name: "food_onnx"
backend: "onnxruntime"
max_batch_size : 0
input [
  {
    name: "input"
    data_type: TYPE_FP32
    format: FORMAT_NCHW
    dims: [ 3, 256, 256 ]
    reshape { shape: [ 1, 3, 256, 256 ] }
  }
]
output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [ 100 ]
    reshape { shape: [1, 100] }
    label_filename: "labels_en.txt"
  }
]
